# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Modern, maintained replacement for ls
brew "eza"
# Command-line fuzzy finder written in Go
brew "fzf"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Magnificent app which corrects your previous console command
brew "thefuck"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Simple terminal UI for git commands
brew "lazygit"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Terminal multiplexer
brew "tmux"
# Plugin manager for tmux
brew "tpm"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Shell extension to navigate your filesystem faster
brew "zoxide"
cask "font-meslo-lg-nerd-font"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
vscode "github.copilot"
vscode "github.copilot-chat"
